[
    {
        "judul": "Membangun Aplikasi E-Commerce UniStore Berbasis Web Service Menggunakan Golang dan MongoDB",
        "abstrak": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di zaman ini, banyak orang merasa lebih nyaman melakukan berbagai aktivitas secara daring, termasuk bermain video game, berinteraksi dengan sesama, bekerja, belajar, dan berbelanja secara online [1]. Terbukti bahwa dalam 10 tahun terakhir, semakin banyak masyarakat yang melakukan jual beli online [2]. Hal ini terjadi karena internet telah berkembang dengan pesat dan memberikan peluang bagi pelaku bisnis untuk menjangkau lebih banyak pelanggan [3]. Oleh karena itu, kami merasa bahwa memulai bisnis e-commerce adalah langkah yang tepat di era sekarang. Dengan berbagai alasan yang telah kami jelaskan di atas, kami percaya bahwa aplikasi ecommerce yang kami kembangkan akan menjadi hal yang umum, bahkan di kalangan pelaku Usaha Mikro, Kecil, dan Menengah (UMKM) di masa depan. Pada studi literatur yang dibuat sebelumnya menunjukan bahwa penggunaan aplikasi e-commerce menjadi lebih efisien bagi para pelaku wirausaha, berdasarkan analisis data statik menunjukan bahwa aplikasi e-commerce dapat mempermudah serta meningkatkan kepercayaan pihak konsumen, dan masih sangat sedikit pelaku UMKM yang menggunakan aplikasi e-commerce meskipun telah terbukti banyak manfaatnya [4]–[6]. Proyek kami bertujuan untuk membuat aplikasi e-commerce yang mudah digunakan oleh para pengusaha kecil, sehingga mereka dapat meraih kesuksesan lebih baik. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam rangka mengembangkan aplikasi layanan web dengan tema e-commerce, ada beberapa masalah yang harus diselesaikan, masalah pertama yaitu membangun  basis data  yang lintas platform, selanjutnya membangun package backend yang dapat diakses secara publik, kemudian membuat API yang dapat menghubungkan backend dengan frontend, dan terakhir mengintegrasikan frontend dengan API yang telah dibuat . Berdasarkan hasil kajian yang telah kami lakukan, kami memutuskan untuk menggunakan bahasa pemrograman Golang dalam upaya membangun backend yang  optimal untuk proyek ini. Meskipun Golang mengintegrasikan prinsip-prinsip Bahasa pemrograman lain, namun perlu ditekankan bahwa Golang menonjol dengan kinerja yang terbilang efisien [7]–[9]. Dalam mengembangkan aplikasi berbasis web, kami merasa penting untuk menyediakan antarmuka yang mampu menampilkan aplikasi dalam format HTML. Untuk tujuan ini, kami memilih untuk menggunakan bahasa  pemrograman JavaScript. Perlu dicatat bahwa JavaScript memiliki keunggulan signifikan dalam konteks pengembangan aplikasi web dan situs, sebab bahasa ini berjalan di sisi klien, mampu menciptakan interaktivitas yang responsif, mendukung pemrosesan asinkron, serta memanfaatkan ekosistem yang sangat beragam dan fleksibel [10]–[12]. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam konteks pengambilan dan penyimpanan data, kami telah memilih system basis data MongoDB. MongoDB adalah sebuah sistem basis data berorientasi dokumen yang bersifat lintas platform dan dikategorikan sebagai sistem basis data NoSQL [13]– [15]. Untuk mengintegrasikan MongoDB dengan frontend, kami memanfaatkan layanan yang disediakan oleh Google Cloud Platform (GCP). Google Cloud Platform adalah suatu rangkaian layanan komputasi, penyimpanan data, dan pengembangan aplikasi di ranah komputasi awan yang awalnya dikembangkan oleh Google [16]–[18].",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di era sekarang ini orang-orang lebih nyaman melakukan sesuatu secara online mulai dari bermain video game secara online, berinteraksi secara online, bekerja secara online, belajar secara online, bahkan berbelanja pun juga secara online. Hal ini disebabkan oleh kemajuan internet yang sangat pesat dan memberikan kesempatan bagi para pelaku bisnis untuk memperluas jangkauan target pasar. Karena itu lah kami merasa memulai e-commerce adalah langkah yang tepat di era sekarang ini.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Masyarakat yang mempraktekkan jual beli online meningkat setiap tahun nya dalam 10 tahun terakhir ini. Oleh karena itu kami memprediksi di tahun yang akan datang aplikasi e-commerce ini akan menjadi hal yang lumrah bahkan di kalangan UMKM. Project kami ini bertujuan untuk membangun aplikasi e-commerce yang dapat digunakan dengan mudah oleh pengusaha-pengusaha kecil.",
        "indentifikasi_masalah": "Berdasarkan latar belakang di atas dapat di identifikasi masalah pada proyek kali ini ialah sebagai berikut :<br><br>1. Bagaimana membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM?<br>2. Bagaimana membuat aplikasi menggunakan framework?<br>3. Bagaimana membuat aplikasi yang terhubungn dengan API?",
        "tujuan": "Berdasarkan masalah yang telah di indetifikasi pada proyek kali ini dapat di uraikan tujuan dari proyek kali ini ialah sebagai berikut :<br><br>1. Membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM.<br>2. Membuat aplikasi menggunakan framework.<br>3. Membuat aplikasi yang terhubung dengan API.",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan adalah Javascript.<br>2. Framework yang digunakan adalah ReactJS.<br>3. Database yang digunakan adalah MongoDB.",
        "jadwal_pelaksanaan": "images/JadwalPelaksanaan.jpg",
        "anggota_tim": "1. Ibrohim Mubarok<br>2. Fitrah Ali Akbar Setiawan"
    }
]