[
    {
        "judul": "Membangun Aplikasi E-Commerce UniStore Berbasis<br>Website Menggunakan ReactJS dan MongoDB",
        "abstrak": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam era digital saat ini, aktivitas online seperti bermain video game, berinteraksi, bekerja, belajar, dan berbelanja semakin populer. Fenomena ini didorong oleh perkembangan internet yang pesat, memberikan peluang bisnis untuk memperluas jangkauan pasar mereka. Oleh karena itu, proyek ini mengangkat isu penting tentang pembangunan aplikasi e-commerce yang sederhana, khususnya untuk Usaha Mikro, Kecil, dan Menengah (UMKM).<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proyek ini mengidentifikasi tiga masalah utama, yaitu bagaimana membuat aplikasi e-commerce yang sederhana dan ramah pengguna bagi UMKM, bagaimana memanfaatkan framework dalam pengembangan aplikasi, dan bagaimana mengintegrasikan aplikasi dengan API eksternal.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dokumentasi proyek ini akan mencakup penggunaan bahasa pemrograman JavaScript, penerapan framework ReactJS, dan penggunaan database MongoDB. Proyek ini diharapkan dapat memberikan solusi praktis untuk UMKM yang ingin memasuki dunia e-commerce dengan cara yang efektif dan efisien.",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di era sekarang ini orang-orang lebih nyaman melakukan sesuatu secara online mulai dari bermain video game secara online, berinteraksi secara online, bekerja secara online, belajar secara online, bahkan berbelanja pun juga secara online. Hal ini disebabkan oleh kemajuan internet yang sangat pesat dan memberikan kesempatan bagi para pelaku bisnis untuk memperluas jangkauan target pasar. Karena itu lah kami merasa memulai e-commerce adalah langkah yang tepat di era sekarang ini.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Masyarakat yang mempraktekkan jual beli online meningkat setiap tahun nya dalam 10 tahun terakhir ini. Oleh karena itu kami memprediksi di tahun yang akan datang aplikasi e-commerce ini akan menjadi hal yang lumrah bahkan di kalangan UMKM. Project kami ini bertujuan untuk membangun aplikasi e-commerce yang dapat digunakan dengan mudah oleh pengusaha-pengusaha kecil.",
        "indentifikasi_masalah": "Berdasarkan latar belakang di atas dapat di identifikasi masalah pada proyek kali ini ialah sebagai berikut :<br><br>1. Bagaimana membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM?<br>2. Bagaimana membuat aplikasi menggunakan framework?<br>3. Bagaimana membuat aplikasi yang terhubungn dengan API?",
        "tujuan": "Berdasarkan masalah yang telah di indetifikasi pada proyek kali ini dapat di uraikan tujuan dari proyek kali ini ialah sebagai berikut :<br><br>1. Membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM.<br>2. Membuat aplikasi menggunakan framework.<br>3. Membuat aplikasi yang terhubung dengan API.",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan adalah Javascript.<br>2. Framework yang digunakan adalah ReactJS.<br>3. Database yang digunakan adalah MongoDB.",
        "jadwal_pelaksanaan": "images/JadwalPelaksanaan.jpg",
        "anggota_tim": "1. Ibrohim Mubarok<br>2. Fitrah Ali Akbar Setiawan"
    }
]