[
    {
        "judul": "Membangun Aplikasi E-Commerce UniStore Berbasis<br>Web Service Menggunakan Golang dan MongoDB",
        "abstrak": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam era digital saat ini, aktivitas online seperti bermain video game, berinteraksi, bekerja, belajar, dan berbelanja semakin populer. Fenomena ini didorong oleh perkembangan internet yang pesat, memberikan peluang bisnis untuk memperluas jangkauan pasar mereka. Oleh karena itu, proyek ini mengangkat isu penting tentang pembangunan aplikasi e-commerce yang sederhana, khususnya untuk Usaha Mikro, Kecil, dan Menengah (UMKM).<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proyek ini mengidentifikasi tiga masalah utama, yaitu bagaimana membuat aplikasi e-commerce yang sederhana dan ramah pengguna bagi UMKM, bagaimana memanfaatkan framework dalam pengembangan aplikasi, dan bagaimana mengintegrasikan aplikasi dengan API eksternal.<br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dokumentasi proyek ini akan mencakup penggunaan bahasa pemrograman JavaScript, penerapan framework ReactJS, dan penggunaan database MongoDB. Proyek ini diharapkan dapat memberikan solusi praktis untuk UMKM yang ingin memasuki dunia e-commerce dengan cara yang efektif dan efisien.",
        "latar_belakang": "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Di zaman ini, banyak orang merasa lebih nyaman melakukan berbagai aktivitas secara daring, termasuk bermain video game, berinteraksi dengan sesama, bekerja, belajar, dan berbelanja secara online [1]. Terbukti bahwa dalam 10 tahun terakhir, semakin banyak masyarakat yang melakukan jual beli online [2]. Hal ini terjadi karena internet telah berkembang dengan pesat dan memberikan peluang bagi pelaku bisnis untuk menjangkau lebih banyak pelanggan [3]. Oleh karena itu, kami merasa bahwa memulai bisnis e-commerce adalah langkah yang tepat di era sekarang. Dengan berbagai alasan yang telah kami jelaskan di atas, kami percaya bahwa aplikasi ecommerce yang kami kembangkan akan menjadi hal yang umum, bahkan di kalangan pelaku Usaha Mikro, Kecil, dan Menengah (UMKM) di masa depan. Pada studi literatur yang dibuat sebelumnya menunjukan bahwa penggunaan aplikasi e-commerce menjadi lebih efisien bagi para pelaku wirausaha, berdasarkan analisis data statik menunjukan bahwa aplikasi e-commerce dapat mempermudah serta meningkatkan kepercayaan pihak konsumen, dan masih sangat sedikit pelaku UMKM yang menggunakan aplikasi e-commerce meskipun telah terbukti banyak manfaatnya [4]–[6]. Proyek kami bertujuan untuk membuat aplikasi e-commerce yang mudah digunakan oleh para pengusaha kecil, sehingga mereka dapat meraih kesuksesan lebih baik. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam rangka mengembangkan aplikasi layanan web dengan tema e-commerce, ada beberapa masalah yang harus diselesaikan, masalah pertama yaitu membangun  basis data  yang lintas platform, selanjutnya membangun package backend yang dapat diakses secara publik, kemudian membuat API yang dapat menghubungkan backend dengan frontend, dan terakhir mengintegrasikan frontend dengan API yang telah dibuat . Berdasarkan hasil kajian yang telah kami lakukan, kami memutuskan untuk menggunakan bahasa pemrograman Golang dalam upaya membangun backend yang  optimal untuk proyek ini. Meskipun Golang mengintegrasikan prinsip-prinsip Bahasa pemrograman lain, namun perlu ditekankan bahwa Golang menonjol dengan kinerja yang terbilang efisien [7]–[9]. Dalam mengembangkan aplikasi berbasis web, kami merasa penting untuk menyediakan antarmuka yang mampu menampilkan aplikasi dalam format HTML. Untuk tujuan ini, kami memilih untuk menggunakan bahasa  pemrograman JavaScript. Perlu dicatat bahwa JavaScript memiliki keunggulan signifikan dalam konteks pengembangan aplikasi web dan situs, sebab bahasa ini berjalan di sisi klien, mampu menciptakan interaktivitas yang responsif, mendukung pemrosesan asinkron, serta memanfaatkan ekosistem yang sangat beragam dan fleksibel [10]–[12]. <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Dalam konteks pengambilan dan penyimpanan data, kami telah memilih system basis data MongoDB. MongoDB adalah sebuah sistem basis data berorientasi dokumen yang bersifat lintas platform dan dikategorikan sebagai sistem basis data NoSQL [13]– [15]. Untuk mengintegrasikan MongoDB dengan frontend, kami memanfaatkan layanan yang disediakan oleh Google Cloud Platform (GCP). Google Cloud Platform adalah suatu rangkaian layanan komputasi, penyimpanan data, dan pengembangan aplikasi di ranah komputasi awan yang awalnya dikembangkan oleh Google [16]–[18].",
        "indentifikasi_masalah": "Berdasarkan latar belakang di atas dapat di identifikasi masalah pada proyek kali ini ialah sebagai berikut :<br><br>1. Bagaimana membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM?<br>2. Bagaimana membuat aplikasi menggunakan framework?<br>3. Bagaimana membuat aplikasi yang terhubungn dengan API?",
        "tujuan": "Berdasarkan masalah yang telah di indetifikasi pada proyek kali ini dapat di uraikan tujuan dari proyek kali ini ialah sebagai berikut :<br><br>1. Membuat aplikasi e-commerce sederhana yang dapat digunakan UMKM.<br>2. Membuat aplikasi menggunakan framework.<br>3. Membuat aplikasi yang terhubung dengan API.",
        "lingkup_dokumentasi": "1. Bahasa pemrograman yang digunakan adalah Javascript.<br>2. Framework yang digunakan adalah ReactJS.<br>3. Database yang digunakan adalah MongoDB.",
        "jadwal_pelaksanaan": "images/JadwalPelaksanaan.jpg",
        "anggota_tim": "1. Ibrohim Mubarok<br>2. Fitrah Ali Akbar Setiawan",
        "daftar_pustaka": "[1]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. Aulia, “Pola Perilaku Konsumen Digital Dalam Memanfaatkan Aplikasi Dompet Digital,” Jurnal Komunikasi, vol. 12, no. 2, pp. 311–324, Dec. 2020, doi: 10.24912/jk.v12i2.9829.<br>[2]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;R. A. Bahtiar, “Potensi, Peran Pemerintah, dan Tantangan dalam Pengembangan E-Commerce di Indonesia [Potency, Government Role, and Challenges of E-Commerce Development in Indonesia],” Jurnal Ekonomi dan Kebijakan Publik, vol. 11, no. 1, pp. 13–25, Jul. 2020, doi: 10.22212/jekp.v11i1.1485.<br>[3]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. Palinggi and E. C. Limbongan, “Pengaruh Internet Terhadap Industri Ecommerce Dan Regulasi Perlindungan Data Pribadi Pelanggan Di Indonesia,” Pengaruh Internet Terhadap Industri Ecommerce Dan Regulasi Perlindungan Data Pribadi Pelanggan Di Indonesia, vol. 4, no. 1, 2020.<br>[4]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;T. S. Goh, Erika, Henry, and E. Sagala, “Analisis E-Commerce Berbasis Marketplace yang Berperan Membantu Wirausaha Pemula Dalam Menjalankan Bisnis,” Indonesian Journal of Economics, Entrepreneurship and Innovation, vol. 2, no. 1, pp. 1–6, May 2021.<br>[5]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;O. R. Purba and P. L. Raja, “Pengaruh Kemudahan dan Kepercayan Konsumen Menggunakan E-Commerce terhadap Keputusan Pembelian (Studi pada Pengguna Shopee di Kota Medan),” Journal of Social Research, vol. 1, no. 9, pp. 1067–1075, Sep. 2022, doi: 10.55324/josr.v1i9.226.<br>[6]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K. Nurjaman, “Pemberdayaan E-Commerce di Kalangan Pelaku UMKM di Indonesia,” Jurnal Abdimas Peradaban, vol. 3, no. 1, pp. 34–40, Feb. 2022, doi: 10.54783/ap.v3i1.6.<br>[7]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;P. Dymora and A. Paszkiewicz, “Performance Analysis of Selected Programming Languages in the Context of Supporting Decision-Making Processes for Industry 4.0,” Applied Sciences, vol. 10, no. 23, 2020, doi: 10.3390/app10238521.<br>[8]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;H. Ardiansyah and A. Fatwanto, “Comparison of Memory usage between REST API in Javascript and Golang,” MATRIK : Jurnal Manajemen, Teknik Informatika dan Rekayasa Komputer, vol. 22, no. 1, pp. 229–240, Nov. 2022, doi: 10.30812/matrik.v22i1.1325.<br>[9]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Y. Sun, “A Comparison between Java and Go for Microservice Development and Cloud Deployment,” 2021. [Online]. Available: https://urn.fi/URN:NBN:fi:amk-202104195171<br>[10]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;E. Ikkala, E. Hyvönen, H. Rantala, and M. Koho, “Sampo-UI: A full stack JavaScript framework for developing semantic portal user interfaces,” Semant Web, vol. 13, no. 1, pp. 69–84, Nov. 2021, doi: 10.3233/sw-210428.<br>[11]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;T. K. Mohd, J. Thompson, A. Carmine, and G. Reuter, “Comparative Analysis on Various CSS and JavaScript Frameworks,” Journal of Software, vol. 17, no. 6, pp. 282–291, Nov. 2022, doi: 10.17706/jsw.17.282-291.<br>[12]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;V. Ballamudi, K. Lal, H. Desamsetti, and S. Dekkati, “Getting Started Modern Web Development with Next.js: An Indispensable React Framework,” Digitalization & Sustainability Review, vol. 1, no. 1, pp. 1–11, 2021.<br>[13]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;B. Jose and S. Abraham, “Performance analysis of NoSQL and relational databases with MongoDB and MySQL,” Mater Today Proc, vol. 24, no. 3, pp. 2036–2043, 2020, doi: 10.1016/j.matpr.2020.03.634.<br>[14]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. Palanisamy and P. SuvithaVani, “A survey on RDBMS and NoSQL Databases MySQL vs MongoDB,” 2020 International Conference on Computer Communication and Informatics (ICCCI), pp. 1–7, Jan. 2020, doi: 10.1109/ICCCI48352.2020.9104047.<br>[15]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;P. Filip and L. Čegan, “Comparison of MySQL and MongoDB with focus on performance,” 2020 International Conference on Informatics, Multimedia, Cyber and Information System (ICIMCIS), pp. 184–187, 2020, doi: 10.1109/ICIMCIS51567.2020.9354307.<br>[16]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. Borge and N. Poonia, “Review on Amazon Web Services, Google Cloud Provider and Microsoft Windows Azure,” Int J Adv Innov Res, vol. 7, no. 3, pp. 49–54, 2020.<br>[17]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;M. Saraswat and R. C. Tripathi, “Cloud Computing: Comparison and Analysis of Cloud Service Providers-AWs, Microsoft and Google,” 2020 9th International Conference System Modeling and Advancement in Research Trends (SMART), pp. 281–285, 2020, doi: 10.1109/SMART50582.2020.9337100.<br>[18]&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;S. Kumar, M. S. Bajwa, and H. Sharma, “A Comparative Study of Various Cloud Service Platforms,” Journal of Advanced Database Management & Systems, vol. 6, no. 1, pp. 7–12, 2019."
    }
]